/*
 *  功能：帮助菜单数据
 *  页面：*.html
 *  Created by nocoolyoyo 2016/11/13.
 */
var helpData = {
    "list": [
        {"question": "会员信息无法批量导入", 	"answer": "需要核对下以下几点：导入表格内红色字体为必填项，确认会员手机号是否正确（会员登录APP的账号就是在商会预留的手机号）。"},
        {"question": "会员手机端通讯录无法查阅", 	"answer": "需要核对下秘书处会员信息录入完毕后是否有分配商会职务，其次查看是否对会员通讯录权限进行设置。"},
        {"question": "后台会员账号（手机号）如何更改", "answer": "只能删除重新录入，或者会员自己通过手机端进行更改。"},
        {"question": "秘书处发布通知通告后，会员手机端有部分人员未收到",   "answer": "需要核对下发送通知通告时是否有进行人员选择发送。"},
        {"question": "焦点位设置后手机端无法显示", "answer": "要检查是否激活成功。"}
    ]
};